import fetch from 'node-fetch'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {
try {
let pp = imagen1
let img = await(await fetch('https://i.imgur.com/JP52fdP.jpg')).buffer()
let d = new Date(new Date + 3600000)
let locale = 'es'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let user = global.db.data.users[m.sender]
let { money, joincount } = global.db.data.users[m.sender]
let { exp, limit, level, role } = global.db.data.users[m.sender]
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let str = `╭─────────────◆
┃𖤓𝑩𝑶𝑻 𝑩𝑨𝑩𝒀
┃𖤓-𝗛ᴏʟᴀ,➺${taguser}
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓│❏ᴏᴡɴᴇʀ:ᴏғᴄ➺𝑨𝑿𝑰𝑬𝑳.𝑩𝑩
┃𖤓│❏ғᴇᴄʜᴀ:➺${date}
┃𖤓│❏ᴛɪᴇᴍᴘᴏ ᴀᴄᴛɪᴠᴏ:➺${uptime}
┃𖤓╰❏ᴜsᴜᴀʀɪᴏs:➺${rtotalreg}
╰━━━━━━━━━━━──⊷
╭─────────────◆
┃𖤓-📽️𝐃𝐄𝐒𝐂𝐀𝐑𝐆𝐀𝐒-⦿🎧
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭──────────◆
┃𖤓│❏ɪɴsᴛᴀɢʀᴀᴍ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ɪɴsᴛᴀɢʀᴀᴍ2➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ɪɴsᴛᴀɢʀᴀᴍ3➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ᴍᴇᴅɪᴀғɪʀᴇ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ɪɴsᴛᴀɢʀᴀᴍ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ɢɪᴛᴄʟᴏɴᴇ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ɢᴅʀɪᴠᴇ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ᴛɪᴋᴛᴏᴋ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏xɴxxᴅʟ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏xᴠɪᴅᴇᴏsᴅʟ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ᴛᴡɪᴛᴛᴇʀ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ғʙ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ғʙ2➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ғʙ3➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ғʙ4➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ғʙ5➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ʏᴛᴍᴘ3➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ʏᴛᴍᴘ4➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ʏᴛᴍᴘ3ᴅᴏᴄ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ʏᴛᴍᴘ4ᴅᴏᴄ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ᴅᴀᴘᴋ2➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏sᴛɪᴄᴋᴇʀᴘᴀᴄᴋ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏ᴘʟᴀʏ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘʟᴀʏ.1➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘʟᴀʏ.2➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘʟᴀʏᴅᴏᴄ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘʟᴀʏʟɪsᴛ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘʟᴀʏʟɪsᴛ2➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴘᴏᴛɪғʏ➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴛɪᴄᴋᴇʀʟʏ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʀɪɴɢᴛᴏɴᴇ➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴏᴜɴᴅᴄʟᴏᴜᴅ➺ᴛᴇxᴛᴏ
┃𖤓│❏ɪᴍᴀɢᴇɴ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘɪɴᴛᴇʀᴇsᴛ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴡᴀʟʟᴘᴀᴘᴇʀ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴡᴀʟʟᴘᴀᴘᴇʀ2➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘᴘᴛɪᴋᴛᴏᴋ➺ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃𖤓│❏ɪɢsᴛᴀʟᴋ➺ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃𖤓│❏ɪɢsᴛᴏʀʏ➺ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃╰❏ᴛɪᴋᴛᴏᴋsᴛᴀʟᴋ➺ᴜsᴇʀɴᴀᴍᴇ
╰━━━━━━━━━━━──⊷
╭─────────────◆
┃𖤓-🧩𝐄𝐒𝐓𝐈𝐊𝐄𝐑𝐒👾-⦿
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭──────────◆
┃𖤓│❏sᴛɪᴄᴋᴇʀ➺ʀᴇsᴘᴏɴᴅᴇʀ➺ᴀ➺ɪᴍᴀɢᴇɴ➺ᴏ➺ᴠɪᴅᴇᴏ
┃𖤓│❏sᴛɪᴄᴋᴇʀ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏s➺ʀᴇsᴘᴏɴᴅᴇʀ➺ɪᴍᴀɢᴇɴ➺ᴏ➺ᴠɪᴅᴇᴏ
┃𖤓│❏s➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏sғᴜʟʟ➺ɪᴍᴀɢᴇɴ➺ᴏ➺ᴠɪᴅᴇᴏ
┃𖤓│❏ᴇᴍᴏᴊɪᴍɪx➺ᴇᴍᴏᴊɪ➺1&ᴇᴍᴏᴊɪ 2
┃𖤓│❏sᴄɪʀᴄʟᴇ➺ɪᴍᴀɢᴇɴ
┃𖤓│❏sʀᴇᴍᴏᴠᴇʙɢ➺ɪᴍᴀɢᴇɴ
┃𖤓│❏sᴇᴍᴏᴊɪ➺ᴛɪᴘᴏ➺ᴇᴍᴏᴊɪ
┃𖤓│❏ᴀᴛᴛᴘ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴀᴛᴛᴘ2➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴀᴛᴛᴘ3➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴛᴛᴘ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴛᴛᴘ2➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴛᴛᴘ3➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴛᴛᴘ4➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴛᴛᴘ5➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴘᴀᴛ➺@ᴛᴀɢ
┃𖤓│❏sʟᴀᴘ➺@ᴛᴀɢ
┃𖤓│❏ᴋɪss➺@ᴛᴀɢ
┃𖤓│❏ᴅᴀᴅᴏ
┃𖤓│❏ᴡᴍ➺ᴘᴀᴄᴋɴᴀᴍᴇ➺ᴀᴜᴛʜᴏʀ
┃𖤓│❏sᴛɪᴄᴋᴇʀᴍᴀʀᴋᴇʀ➺ᴇғᴇᴄᴛᴏ➺ɪᴍᴀɢᴇɴ
┃𖤓╰❏sᴛɪᴄᴋᴇʀғɪʟᴛᴇʀ➺ᴇғᴇᴄᴛᴏ➺ɪᴍᴀɢᴇɴ
╰━━━━━━━━━━━──⊷

╭─────────────◆
┃𖤓-🌴𝐄𝐅𝐄𝐂𝐓𝐎𝐒 𝐘 𝐋𝐎𝐆𝐎𝐒🧨-⦿
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭──────────◆
┃𖤓│❏ᴘʜᴍᴀᴋᴇʀ➺ᴏᴘᴄɪᴏɴ➺ɪᴍᴀɢᴇɴ
┃𖤓│❏ʟᴏɢᴏs➺ᴇғᴇᴄᴛᴏ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʟᴏɢᴏᴄʜʀɪsᴛᴍᴀs➺ᴛᴇxᴛᴏ
┃𖤓│❏ʟᴏɢᴏᴄᴏʀᴀᴢᴏɴ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʏᴛᴄᴏᴍᴍᴇɴᴛ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʜᴏʀɴʏᴄᴀʀᴅ➺@ᴛᴀɢ
┃𖤓│❏sɪᴍᴘᴄᴀʀᴅ➺@ᴛᴀɢ
┃𖤓│❏ʟᴏʟɪᴄᴇ➺@ᴛᴀɢ
┃𖤓│❏ɪᴛssᴏsᴛᴜᴘɪᴅ
┃𖤓│❏ᴘɪxᴇʟᴀʀ
┃𖤓╰❏ʙʟᴜʀ
╰━━━━━━━━━━━──⊷

╭─────────────◆
┃𖤓-🔍𝐁𝐔𝐒𝐂𝐀𝐃𝐎𝐑𝐄𝐒🔎-⦿
┃𖤓᭢━━━━━━━━━᭥᭢
┃𖤓╭──────────◆
┃𖤓│❏ᴍᴏᴅᴀᴘᴋ➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴛɪᴄᴋᴇʀsᴇᴀʀᴄʜ➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴛɪᴄᴋᴇʀsᴇᴀʀᴄʜ2➺ᴛᴇxᴛᴏ
┃𖤓│❏xɴxxsᴇᴀʀᴄʜ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴀɴɪᴍᴇɪɴғᴏ➺ᴛᴇxᴛᴏ
┃𖤓│❏ɢᴏᴏɢʟᴇ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʟᴇᴛʀᴀ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴡɪᴋɪᴘᴇᴅɪᴀ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʏᴛsᴇᴀʀᴄʜ➺ᴛᴇxᴛᴏ
┃𖤓╰❏ᴘʟᴀʏsᴛᴏʀᴇ➺ᴛᴇxᴛᴏ
╰━━━━━━━━━━━──⊷
╭──────────────◆
┃𖤓🎙️𝐂𝐎𝐍𝐕𝐄𝐑𝐓𝐈𝐃𝐎𝐑𝐄𝐒🎚️&
┃𖤓𝐄𝐅𝐄𝐂𝐓𝐎𝐒 𝐃𝐄 𝐀𝐔𝐃𝐈𝐎𝐒--⦿
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭──────────◆
┃𖤓│❏ᴛᴏɢɪғᴀᴜᴅ➺ᴠɪᴅᴇᴏ
┃𖤓│❏ᴛᴏɪᴍɢ➺sᴛɪᴄᴋᴇʀ
┃𖤓│❏ᴛᴏᴍᴘ3➺ᴠɪᴅᴇᴏ
┃𖤓│❏ᴛᴏᴍᴘ3➺ɴᴏᴛᴀ➺ᴅᴇ➺ᴠᴏᴢ
┃𖤓│❏ᴛᴏᴘᴛᴛ➺ᴠɪᴅᴇᴏ➺ᴀᴜᴅɪᴏ
┃𖤓│❏ᴛᴏᴠɪᴅᴇᴏ➺sᴛɪᴄᴋᴇʀ
┃𖤓│❏ᴛᴏᴜʀʟ➺ᴠɪᴅᴇᴏ➺ɪᴍᴀɢᴇɴ➺ᴀᴜᴅɪᴏ
┃𖤓│❏ᴛᴛs➺ᴇs➺ᴛᴇxᴛᴏ
┃𖤓│❏ʙᴀss
┃𖤓│❏ʙʟᴏᴡɴ
┃𖤓│❏ᴅᴇᴇᴘ
┃𖤓│❏ᴇᴀʀʀᴀᴘᴇ
┃𖤓│❏ғᴀsᴛ
┃𖤓│❏ғᴀᴛ
┃𖤓│❏ɴɪɢʜᴛᴄᴏʀᴇ
┃𖤓│❏0ʀᴇᴠᴇʀsᴇ
┃𖤓│❏ʀᴏʙᴏᴛ
┃𖤓│❏sʟᴏᴡ
┃𖤓│❏sᴍᴏᴏᴛʜ
┃𖤓│❏ᴛᴜᴘᴀɪ
╰━━━━━━━━━━━──⊷
╭─────────────𖤓
┃𖤓-🤴𝐎𝐖𝐍𝐄𝐑👸-⦿
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭──────────𖤓
┃𖤓│❏sᴇᴛᴘʀᴇғɪx➺ᴘʀᴇғɪᴊᴏ
┃𖤓│❏ʀᴇsᴇᴛᴘʀᴇғɪx
┃𖤓│❏ᴀᴜᴛᴏᴀᴅᴍɪɴ
┃𖤓│❏ʟᴇᴀᴠᴇɢᴄ
┃𖤓│❏ʙʟᴏᴄᴋʟɪsᴛ
┃𖤓│❏ʙʟᴏᴄᴋ➺@ᴛᴀɢ➺ɴᴜᴍᴇʀᴏ
┃𖤓│❏ᴜɴʙʟᴏᴄᴋ➺@ᴛᴀɢ➺ɴᴜᴍᴇʀᴏ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ʀᴇsᴛʀɪᴄᴛ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ʀᴇsᴛʀɪᴄᴛ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ᴀᴜᴛᴏʀᴇᴀᴅ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ᴀᴜᴛᴏʀᴇᴀᴅ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ᴘᴜʙʟɪᴄ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ᴘᴜʙʟɪᴄ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ᴘᴄᴏɴʟʏ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ᴘᴄᴏɴʟʏ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ɢᴄᴏɴʟʏ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ɢᴄᴏɴʟʏ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪᴄᴀʟʟ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪᴄᴀʟʟ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪᴘʀɪᴠᴀᴅᴏ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪᴘʀɪᴠᴀᴅᴏ
┃𖤓│❏ᴇɴᴀʙʟᴇ➺ᴍᴏᴅᴇᴊᴀᴅɪʙᴏᴛ
┃𖤓│❏ᴅɪsᴀʙʟᴇ➺ᴍᴏᴅᴇᴊᴀᴅɪʙᴏᴛ
┃𖤓│❏ᴍsɢ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʙᴀɴᴄʜᴀᴛ
┃𖤓│❏ᴜɴʙᴀɴᴄʜᴀᴛ
┃𖤓│❏ʙᴀɴᴜsᴇʀ➺@ᴛᴀɢ
┃𖤓│❏ᴜɴʙᴀɴᴜsᴇʀ➺@ᴛᴀɢ
┃𖤓│❏ᴅᴀʀᴅɪᴀᴍᴀɴᴛᴇs➺@ᴛᴀɢ
┃𖤓│❏ʙᴀɴᴜsᴇʀ➺@ᴛᴀɢ
┃𖤓│❏ʙᴄ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʙᴄᴄʜᴀᴛs➺ᴛᴇxᴛᴏ
┃𖤓│❏ʙᴄɢᴄ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʙᴄɢᴄ2➺ᴀᴜᴅɪᴏ
┃𖤓│❏ʙᴄɢᴄ2➺ᴠɪᴅᴇᴏ
┃𖤓│❏ʙᴄɢᴄ2➺ɪᴍᴀɢᴇɴ
┃𖤓│❏ʙᴄʙᴏᴛ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴄʟᴇᴀʀᴛᴘᴍ
┃𖤓│❏ʀᴇsᴛᴀʀᴛ
┃𖤓│❏ᴜᴘᴅᴀᴛᴇ
┃𖤓│❏ʙᴀɴʟɪsᴛ
┃𖤓│❏ᴀᴅᴅᴘʀᴇᴍ➺@ᴛᴀɢ
┃𖤓│❏ᴅᴇʟᴘʀᴇᴍ➺@ᴛᴀɢ
┃𖤓│❏ʟɪsᴛᴘʀᴇᴍ
┃𖤓│❏ʟɪsᴛᴄᴍᴅ
┃𖤓│❏sᴇᴛᴘᴘʙᴏᴛ➺ʀᴇsᴘᴏɴᴅᴇʀ➺ᴀ➺ɪᴍᴀɢᴇɴ
┃𖤓│❏ᴀᴅᴅᴄᴍᴅ➺ᴛᴇxᴛᴏ➺ʀᴇsᴘᴏɴᴅᴇʀ➺ᴀ➺sᴛɪᴄᴋᴇʀ➺ɪᴍᴀɢᴇɴ
┃𖤓╰❏ᴅᴇʟᴄᴍᴅ➺ʀᴇsᴘᴏɴᴅᴇʀ➺ᴀ➺sᴛɪᴄᴋᴇʀ➺ɪᴍᴀɢᴇɴ➺ᴄᴏɴ➺ᴄᴏᴍᴀɴᴅᴏ➺ᴏ➺ᴛᴇxᴛᴏ➺ᴀsɪɢɴᴀᴅᴏ
╰━━━━━━━━━━━──⊷
╭─────────────◆
┃𖤓-👥𝐆𝐑𝐔𝐏𝐎👩‍🏫-⦿
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭──────────◆
┃𖤓│❏ᴀᴅᴅ➺ɴᴜᴍᴇʀᴏ
┃𖤓│❏ᴋɪᴄᴋ➺@ᴛᴀɢ
┃𖤓│❏ᴋɪᴄᴋ2➺@ᴛᴀɢ
┃𖤓│❏ʟɪsᴛᴀɴᴜᴍ➺ᴛᴇxᴛᴏ
┃𖤓│❏ᴋɪᴄᴋɴᴜᴍ➺ᴛᴇxᴛᴏ
┃𖤓│❏ɢʀᴜᴘᴏ➺ᴀʙʀɪʀ➺ᴄᴇʀʀᴀʀ
┃𖤓│❏ɢʀᴏᴜᴘᴛɪᴍᴇ➺ᴏᴘᴄɪᴏɴ➺ᴛɪᴍᴘᴏ
┃𖤓│❏ᴘʀᴏᴍᴏᴛᴇ➺@ᴛᴀɢ
┃𖤓│❏ᴅᴇᴍᴏᴛᴇ➺@ᴛᴀɢ
┃𖤓│❏ᴀᴅᴍɪɴs➺ᴛᴇxᴛᴏ➺𝑢𝑠𝑜 𝑠𝑖𝑛 𝑝𝑟𝑒𝑓𝑖𝑗𝑜
┃𖤓│❏ᴅᴇᴍᴏᴛᴇ➺@ᴛᴀɢ
┃𖤓│❏ɪɴғᴏɢʀᴏᴜᴘ
┃𖤓│❏ʀᴇsᴇᴛʟɪɴᴋ
┃𖤓│❏ʟɪɴᴋ
┃𖤓│❏sᴇᴛɴᴀᴍᴇ➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴇᴛᴅᴇsᴄ➺ᴛᴇxᴛᴏ
┃𖤓│❏ɪɴᴠᴏᴄᴀʀ➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴇᴛᴡᴇʟᴄᴏᴍᴇ➺ᴛᴇxᴛᴏ
┃𖤓│❏sᴇᴛʙʏᴇ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʜɪᴅᴇᴛᴀɢ➺ᴛᴇxᴛᴏ
┃𖤓│❏ʜɪᴅᴇᴛᴀɢ➺ᴀᴜᴅɪᴏ
┃𖤓│❏ʜɪᴅᴇᴛᴀɢ➺ᴠɪᴅᴇᴏ
┃𖤓│❏ʜɪᴅᴇᴛᴀɢ➺ɪᴍᴀɢᴇɴ
┃𖤓│❏ᴡᴀʀɴ➺@ᴛᴀɢ
┃𖤓│❏ᴜɴᴡᴀʀɴ➺@ᴛᴀɢ
┃𖤓│❏ʟɪsᴛᴡᴀʀɴ
┃𖤓│❏ғᴀɴᴛᴀsᴍᴀs
┃𖤓│❏ᴅᴇsᴛʀᴀʙᴀ
┃𖤓╰❏sᴇᴛᴘᴘ➺ɪᴍᴀɢᴇɴ
╰━━━━━━━━━━━──⊷
╭─────────────◆
│𖤓-👩‍🔧𝐇𝐄𝐑𝐑𝐀𝐌𝐈𝐄𝐍𝐓𝐀𝐒👩‍🏭-⦿
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭──────────◆
┃𖤓│❏ᴄʜᴀᴛɢᴘᴛ➺ᴛᴇxᴛᴏ
┃𖤓│❏️ᴅᴀʟʟ-ᴇ➺ᴛᴇxᴛᴏ
┃𖤓│❏️ᴛᴀᴍᴀñᴏ➺ᴄᴀɴᴛɪᴅᴀᴅ➺ɪᴍᴀɢᴇɴ➺ᴠɪᴅᴇᴏ
┃𖤓│❏️ᴄʟɪᴍᴀ➺ᴘᴀís➺ᴄɪᴜᴅᴀᴅ
┃𖤓│❏️ᴇɴᴄᴜᴇsᴛᴀ➺ᴛᴇxᴛᴏ1|ᴛᴇxᴛᴏ2...
┃𖤓│❏️ᴀғᴋ➺ᴍᴏᴛɪᴠᴏ
┃𖤓│❏️ᴏᴄʀ➺ʀᴇsᴘᴏɴᴅᴇ➺ᴀ➺ɪᴍᴀɢᴇɴ
┃𖤓️│❏ᴀᴄᴏʀᴛᴀʀ➺ᴇɴʟᴀᴄᴇ➺ʟɪɴᴋ
┃𖤓│❏️ᴄᴀʟᴄ➺ᴏᴘᴇʀᴀᴄɪᴏɴ➺ᴍᴀᴛʜ
┃𖤓│❏️ᴅᴇʟ➺ᴍᴇɴsᴀᴊᴇ
┃𖤓│❏️ᴡʜᴀᴛᴍᴜsɪᴄ➺ᴀᴜᴅɪᴏ
┃𖤓│❏️ʀᴇᴀᴅǫʀ➺ɪᴍᴀɢᴇɴ➺ǫʀ
┃𖤓│❏️ǫʀᴄᴏᴅᴇ➺ᴛᴇxᴛᴏ
┃𖤓️│❏ʀᴇᴀᴅᴍᴏʀᴇ➺ᴛᴇxᴛᴏ1| ᴛᴇxᴛᴏ2
┃𖤓│❏sᴛʏʟᴇᴛᴇxᴛᴛ➺ᴇxᴛᴏ
┃𖤓│❏ᴛʀᴀᴅᴜᴄɪʀ➺ᴛᴇxᴛᴏ
┃𖤓│❏ɴᴏᴡᴀ➺ɴᴜᴍᴇʀᴏ
┃𖤓│❏ᴄᴏᴠɪᴅ➺ᴘᴀɪs
┃𖤓╰❏ʜᴏʀᴀʀɪᴏ
╰━━━━━━━━━━━──⊷
╭─────────────◆
│𖤓✔️𝐀𝐂𝐓𝐈𝐕𝐀𝐑 𝐎 𝐃𝐄𝐒𝐀𝐂𝐓𝐈𝐕𝐀𝐑❎
┃𖤓🍁᭢━━━━━━━━━᭥🍁᭢
┃𖤓╭─────────────◆ 
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴡᴇʟᴄᴏᴍᴇ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴡᴇʟᴄᴏᴍᴇ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴍᴏᴅᴏʜᴏʀɴʏ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴍᴏᴅᴏʜᴏʀɴʏ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪʟɪɴᴋ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪʟɪɴᴋ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪʟɪɴᴋ2
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪʟɪɴᴋ2
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴅᴇᴛᴇᴄᴛ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴅᴇᴛᴇᴄᴛ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪᴛᴏxɪᴄ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪᴛᴏxɪᴄ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪᴛʀᴀʙᴀ
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪᴛʀᴀʙᴀ
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴀɴᴛɪᴀʀᴀʙᴇs
┃𖤓│▢/ᴅɪsᴀʙʟᴇ➺ᴀɴᴛɪᴀʀᴀʙᴇs
┃𖤓│▢/ᴇɴᴀʙʟᴇ➺ᴍᴏᴅᴏᴀᴅᴍɪɴ
┃𖤓╰▢/ᴅɪsᴀʙʟᴇ➺ᴍᴏᴅᴏᴀᴅᴍɪɴ
╰━━━━━━━━━━━──⊷
ᴏᴡɴᴇʀ:𝑨𝑿𝑰𝑬𝑳.𝑩𝑩
ɴᴜᴍᴇʀᴏ:Wa.me/528123422244`.trim()
if (m.isGroup) {
conn.sendMessage(m.chat, { image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map(v => v[1] + '@s.whatsapp.net')}, { quoted: m })    
} else {    
let fkontak2 = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }  
conn.sendMessage(m.chat, { image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map(v => v[1] + '@s.whatsapp.net')}, { quoted: fkontak2 })}
} catch {
conn.reply(m.chat, '*[❗𝐈𝐍𝐅𝐎❗] 𝙴𝙻 𝙼𝙴𝙽𝚄 𝚃𝙸𝙴𝙽𝙴 𝚄𝙽 𝙴𝚁𝚁𝙾𝚁 𝚈 𝙽𝙾 𝙵𝚄𝙴 𝙿𝙾𝚂𝙸𝙱𝙻𝙴 𝙴𝙽𝚅𝙸𝙰𝚁𝙻𝙾, 𝚁𝙴𝙿𝙾𝚁𝚃𝙴𝙻𝙾 𝙰𝙻 𝙿𝚁𝙾𝙿𝙸𝙴𝚃𝙰𝚁𝙸𝙾 𝙳𝙴𝙻 𝙱𝙾𝚃*', m)
}}
handler.command = /^(menu|menú|memu|memú|help|info|comandos|allmenu|2help|menu1.2|ayuda|commands|commandos|cmd)$/i
handler.exp = 50
handler.fail = null
export default handler
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}
